export interface Question {
  id: number;
  question: string;
  answer: string;
  sectionId: number;
}

export const questions: Question[] = [
  // ====================== پیش از ثبت‌نام (sectionId = 1) ======================
  {
    id: 1,
    sectionId: 1,
    question: "بچه ها از چه سنی یادگیری زبان را شروع کنند بهتر است؟",
    answer:
     "بسیاری از کار‌شناسان بر این باورند هرچه زبان دوم در سنین پایین‌تری به کودک آموزش داده شود احتمال این‌که کودک در سال‌های بعد در یادگیری این زبان موفق‌تر باشد، بیشتر است. در همین راستا موسسه برای کودکان از سن پنج سال کلاس زبان برگزار می کند"
  },
  {
    id: 2,
    sectionId: 1,
    question: "چگونه می‌توانم فرزندم را در آکادمی صبا ثبت‌نام کنم؟",
    answer:
      "دو روش ثبت‌نام وجود دارد: 1) از طریق سایت www.academysaba.com و تکمیل اطلاعات. 2) مراجعه حضوری به آکادمی. ثبت‌نام بعد از تعیین سطح و مشاوره انجام می‌شود.",
  },
  {
    id: 3,
    sectionId: 1,
    question: "مدارک لازم برای ثبت‌نام چیست؟",
    answer:
      "1- کپی کارت ملی 2- یک قطعه عکس 3- پرداخت مبلغ شهریه یا از طریق دستگاه کارت خوان در موسسه یا از طریق درگاه پرداخت اینترنتی موسسه و یا کارت به کارت 4- تکمیل و امضاء فرم تقاضای ثبت نام",
  },
  {
    id: 4,
    sectionId: 1,
    question: "زمان برگزاری هر جلسه فرزندم چقدر به طول می‌انجامد؟",
    answer:
      "هر جلسه آموزشی در دوره ی نونهالان 45 دقیقه  - دوره ی کودکان 60  دقیقه – دوره ی نوجوانان 75 دقیقه - دوره ی بزرگسالان 90 دقیقه زمان می‌برد.",
  },
  {
    id: 5,
    sectionId: 1,
    question: "چرا باید در امتحان تعیین سطح شرکت کرد؟",
    answer:
      "برای تشخیص و تعیین سطح و دوره مناسب، تمامی دانش آموزان جدید می بایستی در آزمون تعیین سطح شرکت نمایند. دانش آموزان مختلف با سطوح متفاوتی از توانایی های زبانی به این مؤسسه مراجعه می نمایند، بنابراین آزمون تعیین سطح میزان مناسبی جهت ارزیابی آنان بوده و به آنها کمک می کند تا در سطح و دوره مناسب با توانایی هایشان شرکت نمایند",
  },
  {
    id: 6,
    sectionId: 1,
    question: "اگر فرزندم بخواهد از اول شروع کند تعیین سطح لازم است؟",
    answer:
      "خیر، اما مشاوره ی رایگان از سوی تیم آموزش آکادمی صبا یاری رسان شما در برنامه ریزی مناسب برای آینده تحصیلی فرزندتان خواهد بود.",
  },
  {
    id: 7,
    sectionId: 1,
    question: "تعیین سطح به‌صورت کتبی انجام می‌شود یا شفاهی؟",
    answer:
      "تعیین سطح برای سنجش مهارت گفتاری به‌صورت شفاهی انجام می‌شود.",
  },
  {
    id: 8,
    sectionId: 1,
    question: "در تعیین سطح چه سوالاتی پرسیده می‌شود؟",
    answer:
      "در این تعیین سطح که به صورت شفاهی برگزار می شود، سوالات روزمره با هدف استفاده از دستور زبانی از ایشان پرسیده می شود.",
  },
  {
    id: 9,
    sectionId: 1,
    question:
      "با توجه به اینکه فرزندم در موسسه دیگری تحصیل کرده، آیا نیاز به تعیین سطح مجدد هست؟",
    answer:
      "بله، سیستم آموزشی مکالمه محور آکادمی صبا، باعث تمایز این موسسه با سایر موسسات دیگر میشود، لذا برای سنجش هرچه بهتر توانایی مکالمه در فرزندتان، به این تعیین سطح برای ورود به موسسه نیاز است.",
  },
  {
    id: 10,
    sectionId: 1,
    question: "آیا برای تعیین سطح باید از قبل وقت بگیرم؟",
    answer:
      "تعیین سطح در هر زمان از حضور شما به همراه فرزندتان در موسسه امکان پذیر است، لذا جهت تسریع در این امر شما می توانید از قبل به صورت تلفنی زمان مناسب برای تعیین سطح را از موسسه جویا شده و در زمان تعیین شده در موسسه حضور یابید.",
  },
  {
    id: 11,
    sectionId: 1,
    question: "پس از انجام تعیین سطح ، چگونه فرزندم را ثبت‌نام کنم؟",
    answer:
      "متقاضیان ثبت نام پس از انجام تعیین سطح و مشاوره جهت تعیین زمان کلاس خود، می‌توانند از طریق سایت آکادمی صبا و پس از تکمیل فرم عضویت و دریافت شناسه کاربری و رمز عبور ثبت نام خود را انجام دهند.",
  },
  {
    id: 12,
    sectionId: 1,
    question: "بعد از گذراندن چند ترم می‌توان مکالمه کرد؟",
    answer:
      "حدود دو سال بعد، زبان‌آموز قادر به درک مطالب پایه‌ای و بیان منظور خود خواهد بود.",
  },
  {
    id: 13,
    sectionId: 1,
    question: "آیا کلاس‌ها تضمینی برای نمرات مدرسه هستند؟",
    answer:
      "بله، با حضور مؤثر در کلاس‌های صبا انتظار می‌رود زبان‌آموز نمرات خوبی در مدرسه بگیرد.",
  },
  {
    id: 14,
    sectionId: 1,
    question: "آیا در کلاس‌ها از کارتون استفاده می‌شود؟",
    answer:
      "بله، برای تلطیف فضای کلاس و کاربردی‌کردن مطالب از کارتون استفاده می‌شود.",
  },
  {
    id: 15,
    sectionId: 1,
    question:
      "چگونه تاریخ شروع و پایان کلاس‌ها و آزمون‌ها را بدانم؟",
    answer:
      "با مراجعه به تقویم آموزشی سالانه در سایت www.academysaba.com.",
  },
  {
    id: 16,
    sectionId: 1,
    question: "آیا غیبت فرزندم اطلاع داده می‌شود؟",
    answer:
      "بله، به‌صورت سیستمی یا تلفنی به والدین اطلاع داده می‌شود.",
  },
  {
    id: 17,
    sectionId: 1,
    question: "پس از چه مدت می‌توان روان صحبت کرد؟",
    answer:
      "با تمرین و یادگیری درست، در سطح Pre-Intermediate قادر به مکالمه خواهید بود.",
  },
  {
    id: 18,
    sectionId: 1,
    question: "آیا در پایان دوره مدرک داده می‌شود؟",
    answer:
      "بله، پس از اتمام دوره Advanced گواهی فارغ‌التحصیلی داده می‌شود.",
  },
  {
    id: 19,
    sectionId: 1,
    question: "آیا مدارک صبا معتبر است؟",
    answer:
      "در برخی سازمان‌ها بسته به نیاز آن‌ها معتبر است.",
  },
  {
    id: 20,
    sectionId: 1,
    question: "آیا مدرسان مؤسسه دارای مدرک دانشگاهی هستند؟",
    answer:
      "اکثر مدرسان دارای مدرک کارشناسی یا کارشناسی ارشد هستند.",
  },
  {
    id: 21,
    sectionId: 1,
    question: "آیا فقط مکالمه تدریس می‌شود؟",
    answer:
      "تمرکز بر مکالمه است اما دستور زبان، واژگان و سایر مهارت‌ها نیز آموزش داده می‌شود.",
  },
  {
    id: 22,
    sectionId: 1,
    question: "آیا کلاس خصوصی دارید؟",
    answer:
      "اولویت با کلاس‌های گروهی است ولی در صورت درخواست و امکان، کلاس خصوصی برگزار می‌شود.",
  },
  {
    id: 23,
    sectionId: 1,
    question: "چگونه ثبت‌نام اینترنتی انجام دهم؟",
    answer:
      "با ورود به سایت، انتخاب ترم، مطالعه قوانین و پرداخت آنلاین می‌توانید ثبت‌نام کنید.",
  },
  {
    id: 24,
    sectionId: 1,
    question: "رمز عبورم را فراموش کرده‌ام. چه کنم؟",
    answer:
      "از قسمت 'Forgot your password' با وارد کردن کد ملی و شماره همراه ثبت‌شده رمز جدید بگیرید.",
  },
  {
    id: 25,
    sectionId: 1,
    question: "اگر انتقاد یا پیشنهادی داشته باشیم چه کنیم؟",
    answer:
      "از طریق ایمیل، فرم ارتباط با ما در سایت یا تماس تلفنی می‌توانید پیشنهادات خود را اعلام کنید.",
  },
  {
    id: 26,
    sectionId: 1,
    question: "آیا پس از دریافت دیپلم صبا می‌توان تدریس کرد؟",
    answer:
      "با قبولی در آزمون کتبی و مصاحبه و گذراندن دوره تربیت مدرس، امکان تدریس وجود دارد.",
  },

  // ====================== امتحانات و آزمون‌ها (sectionId = 2) ======================
  {
    id: 27,
    sectionId: 2,
    question: "غیبت‌های مجاز در هر ترم چند جلسه است؟",
    answer: "حداکثر 3 جلسه غیبت مجاز است.",
  },
  {
    id: 28,
    sectionId: 2,
    question: "امتحان پایان ترم شامل چه مباحثی است؟",
    answer:
      "به‌صورت شفاهی و کتبی و شامل تمام مباحث تدریس‌شده در ترم است.",
  },
  {
    id: 29,
    sectionId: 2,
    question: "حداقل نمره قبولی چند است؟",
    answer: "حداقل نمره قبولی 75 است.",
  },
  {
    id: 30,
    sectionId: 2,
    question: "آیا در پایان هر ترم کارنامه داده می‌شود؟",
    answer:
      "بله، کارنامه در سایت www.academysaba.com در بخش کارنامه‌های من قابل مشاهده است.",
  },
  {
    id: 31,
    sectionId: 2,
    question:
      "در صورت غیبت در امتحان پایان‌ترم چه می‌شود؟",
    answer:
      "امتحان پایان‌ترم کتبی فقط یک بار برگزار می‌شود و در صورت غیبت، تکرار نخواهد شد.",
  },
  {
    id: 32,
    sectionId: 2,
    question: "نوع امتحانات چگونه است؟",
    answer:
      "دو امتحان میان‌ترم و پایان‌ترم (هر کدام  20 نمره) + ارزیابی شفاهی (30 نمره) + فعالیت کلاسی (30 نمره) مجموعاً از 100 نمره.",
  },
  {
    id: 33,
    sectionId: 2,
    question: "چگونه از روند پیشرفت تحصیلی آگاه شوم؟",
    answer:
      "در طول هر ترم آموزشی جلساتی تحت عنوان ” ملاقات استاد با والدین برگزار می‌گردد که در آن استاد کلاس با والدین دانش آموزان در جوی صمیمی در مورد روند پیشرفت تحصیلی دانش آموزان صحبت کرده و راهکارهایی برای پیشرفت زبان آموزان ارائه می‌نماید. این بازخوردها میتواند به صورت تلفنی هم به والدین انتقال داده شوند. همچنین روند تحصیلی دانش آموزان توسط تیم آموزش رصد شده و در صورت نیاز به والدین مشاوره داده می‌شود، تا زبان آموز بتواند هرچه بهتر پیشرفت کرده و از آموخته های خود در تمامی محیط‌های آموزشی علی‌الخصوص مدرسه استفاده نماید.",
  },
  {
    id: 34,
    sectionId: 2,
    question: "عملکرد فرزند من به چه صورتی ارزیابی خواهد شد؟ نوع امتحانات به چه صورت است؟",
    answer:
      "در هر ترم آموزشی ۲ امتحان و یک ارزیابی دقیق شفاهی در انتهای ترم برگزار می گردد. یک امتحان میان ترم و یک امتحان پایان ترم که نمرات آن از 20 محاسبه می شود و مهارت صحبت کردن و استفاده از مطالب که تا کنون یاد گرفته به صورت شفاهی ارزیابی می¬گردد که از 30 نمره محاسبه می¬گردد. این امتحان توانایی زبان آموز در بکارگیری از ساختارهای گرامری ، استفاده از واژگان و تلفظ زبان آموزان را مورد ارزیابی قرار میدهد. همچنین فعال بودن زبان آموز در کلاس، انجام تکالیف  پیشرفت دانش آموز از طریق نمره فعالیت کلاسی که 30 نمره است و توسط استاد کلاس به هر زبان آموز نوجوان اختصاص می آبد، سنجیده می شود. در مجموع نمرات زبان آموز نوجوان از ۱۰۰  محاسبه میگردد.",
  },
  {
    id: 35,
    sectionId: 2,
    question:
      "در صورت عدم شرکت در امتحان پایان دوره چه باید کرد؟",
    answer:
      "با ارائه دلیل موجه به مدیر، امکان شرکت در امتحان جبرانی وجود دارد.",
  },

  // ====================== شرایط مالی (sectionId = 3) ======================
  {
    id: 36,
    sectionId: 3,
    question: "میزان شهریه هر دوره چقدر است؟",
    answer:
      "شهریه هر سال توسط آموزش و پرورش استان تعیین می‌شود.",
  },
  {
    id: 37,
    sectionId: 3,
    question: "شرایط استرداد شهریه چگونه است؟",
    answer:
      "قبل از شروع کلاس، 20٪ کسر و 80٪ بازگردانده می‌شود. بعد از شروع کلاس، شهریه بازگردانده نمی‌شود.",
  },
];
